<!doctype public "-//w3c//dtd html 4.01 transitional//en" 
		"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  <title>Dessin de ROI dans Anatomist</title>
  <style type="text/css">
    BODY {
	  text-align: justify;
	  margin: 0.5cm;
	}
  </style>
</head>
<body text="#000000" bgcolor="#FFFFFF" link="#0000EF" vlink="#51188E" alink="#FF0000">

<center><table WIDTH="100%" NOSAVE >
<tr NOSAVE>
<td ALIGN=RIGHT VALIGN=CENTER NOSAVE><img SRC="../../images/roi.png" NOSAVE align=CENTER></td>

<td ALIGN=CENTER VALIGN=CENTER WIDTH="100%" NOSAVE>
<h1>
Dessin de R.O.I. dans Anatomist</h1>
</td>

<td><a href="http://www-dsv.cea.fr/content/cea/d_dep/d_drm/d_shfj/d_unaf/">
<img SRC="../../images/logo_shfj_t.png" NOSAVE BORDER=0 align=CENTER></a>
<a href="mailto:&#109;&#97;&#110;&#103;&#105;&#110;&#64;&#115;&#104;&#102;&#106;&#46;&#99;&#101;&#97;&#46;&#102;&#114;">
<img SRC="../../images/feather.png" NOSAVE BORDER=0 align=CENTER></a>
</td>
</tr>
</table></center>

<hr WIDTH="100%">
<h2>
Introduction</h2>
Vous pouvez maintenant oublier l'interface lourde pr&eacute;c&eacute;dente
d'Anatomist. Voici une nouvelle mouture, qui devrait vous simplifier la
t&acirc;che.&nbsp; L'interface de ROI peut &ecirc;tre lanc&eacute;e de
nimporte quelle fen&ecirc;tre anatomist contenant une image.
<p>Pour l'obtenir :
<li>
Charger une image dans Anatomist</li>

<li>
L'afficher dans une fen&ecirc;tre (2D ou 3D).</li>

<li>
Appuyer sur "F1"</li>

<li>
Vous voyez alors une fen&ecirc;tre de boite &agrave; outil s'ouvrir, qui
contient deux onglets (pour l'instant) : un onglet RoiManagement et un
onglet Paint.</li>

<li>
Le premier vous permet d'ouvrir des sessions de ROI, de cr&eacute;er ou
d'ouvrir de nouvelles r&eacute;gions, et de les sauver. Le deuxi&egrave;me
vous permet de choisir votre pinceau, diverses options de dessins, mais
aussi de revenir sur vos pas si n&eacute;cessaire.</li>

<br>&nbsp;
<h2>
Philosophie</h2>
Une fois l'interface de ROI lanc&eacute;e, vous n'avez plus besoin de la
fen&ecirc;tre de contr&ocirc;le pour g&eacute;rer les ROI, qu'il s'agisse
de cr&eacute;atrion de session, de r&eacute;gion ou d'entr&eacute;es sorties,
mais aussi d'ouverture de nouvelles fen&ecirc;tres de dessin. La fen&ecirc;tre
de contr&ocirc;le reste utile pour effectuer des fusions, charger des images,
g&eacute;rer les r&eacute;f&eacute;rentiels et tansformations, etc.
<br>&nbsp;
<h2>
Gestion de ROI</h2>

<h3>
Interface</h3>
L'interface comprend un panneau et un menu. Toutes les actions passent
par le menu, tandis que le panneau vous permet de visualiser et de s&eacute;lectionner
vos sessions, r&eacute;gions et images.
<br>&nbsp;
<h3>
Cadre de travail</h3>
Le menu "<i>FrameWork</i>" vous permet de fixer le cadre dans lequel vous
allez dessiner. En d'autres termes, ce cadre d&eacute;terminera les noms
possibles pour les diff&eacute;rentes r&eacute;gions. Bien que vous puissiez
&agrave; tout moment de changer de cadre, nous vous recommandons fortement
d'en choisir un et de vous y tenir. En effet, si les cadres vous restreignent
quant aux noms que vous pourrez choisir pour vos r&eacute;gions, ils assurent
que lesdits noms sont conformes &agrave; ceux choisis par d'autres membres
du service, voire &agrave; la litt&eacute;rature. Des d&eacute;veloppements
concernant des m&eacute;canismes avanc&eacute;s de s&eacute;lection de
r&eacute;gions sont en cours dans l'UNAF. Les cadres actuellement disponibles
sont les suivants :
<br>&nbsp;
<h5>
Neuro</h5>
Utilisez ce cadre de travail lorsque vous dessinez des r&eacute;gions sur
les noyaux gris centraux et le cenrveau en g&eacute;n&eacute;ral. Ce cadre
de travail ne contient pas les noms des sillons.
<h5>
Sulci</h5>
Ce cadre de travail convient parfaitement pour le dessin ou la retouche
de sillons corticaux.
<h5>
Rat_wb</h5>
Le cadre rat contient des noms de r&eacute;gions anatomiques propres au
rat, pour les travaux sur les oligo-nucl&eacute;otides.
<h5>
User Defined</h5>
Lorsqu'aucun cadre ne convient, ou que vous voulez rajouter des r&eacute;gions
inconnues du cadre sur lequel vous travaillez actuellement, s&eacute;lectionnez
ce cadre de travail. Vous pourrez donner les noms que vous voulez &agrave;
vos r&eacute;gions.
<h3>
Session</h3>
Une session de r&eacute;gion d'int&eacute;r&ecirc;t correspond &agrave;
un unique fichier ROI. Elle peut contenir de tr&egrave;s nombreuses r&eacute;gions
diff&eacute;rentes, mais ayant chacune un nom diff&eacute;rent.
<h5>
Ouvrir une session de dessin</h5>
Commencez par s&eacute;lectionnez l'image sur laquelle vous voulez dessiner.
Vous pouvez soit cr&eacute;er une nouvelle session, en passant par le menu
"<i>Session->New</i>", soit charger un fichier de ROI, en s&eacute;lectionnant
dans le menu "<i>Session->Open</i>".
<h5>
Changer de session</h5>
Vous pouvez avoir autant de sessions de dessin ouvertes que vous voulez,
m&ecirc;me si, pratiquement, il est peu probable que vous d&eacute;passiez
deux ou trois sessions en m&ecirc;me temps. Pour passer d'une session &agrave;
une autre, s&eacute;lectionnez-la tout simplement dans le panneau Session.
Les r&eacute;gions dont la session est constitu&eacute;e apparaissent alors
dans le panneau R&eacute;gion, juste &agrave; droite.
<h5>
Renommer une session</h5>
Pour renommer une session, double-cliquez sur son nom dans le panneau Session.
Une fen&ecirc;tre appara&icirc;t vous demandant de saisir son nouveau nom.
<h5>
Fermer la session</h5>
Si une session ne vous convient plus, vous pouvez la fermer, c'est-&agrave;-dire
la d&eacute;truire. Pou ce faire, s&eacute;lectionn&eacute;e la dans le
panneau Session, puis s&eacute;lectionnez dans le menu "<i>Session->Close</i>".
<p>ATTENTION : vous perdrez toutes les r&eacute;gions qu'elle contient
si vous ne l'avez pas sauv&eacute;e.
<h5>
Sauver la session</h5>
Il est conseill&eacute; de sauver r&eacute;guli&egrave;rement votre travail,
au moins toutes les vint minutes, pour &eacute;viter les cons&eacute;quences
d'un crash malheureux. C'est aussi utile lorsque vous avez termin&eacute;
votre travail pour la journ&eacute;e et que vous voulez fermer anatomist.
Pour sauver une session,&nbsp; s&eacute;lectionnez la dans le tableau Session,
puis choisissez dans le menu "<i>Session->Save As</i>". N'oubliez pas de
terminer votre nom de ficher par .arg. Si vous l'oubliez, ce n'est pas
grave, changez dans une fen&ecirc;tre Unix ou Linux le nom du fichier de
fa&ccedil;on &agrave; rajouter le suffixe.
<p>Votre session se trouve maintenant sur le disque sous la forme d'un
fichier .arg et d'un r&eacute;pertoire .data. Vous pourrez effectuer des
statistiques sur les r&eacute;gions dessin&eacute;es avec la commande AimsVoiStat,
entre autres choses.
<p>Si vous voulez retoucher plus tard votre r&eacute;gion :
<li>
relancez Anatomist,</li>

<li>
chargez l'image sur laquelle la session a &eacute;t&eacute; ouverte,</li>

<li>
fa&icirc;tes appara&icirc;tre la Boite &agrave; Outils de ROI comme indiqu&eacute;
ci-dessus.</li>

<li>
s&eacute;lectionnez dans le tableau Images l'image sur laquelle la session
a &eacute;t&eacute; cr&eacute;&eacute;e.</li>

<li>
chargez votre fichier de ROI&nbsp; en s&eacute;lectionnant dans le menu
"<i>Session->Open</i>".</li>

<br>&nbsp;
<h3>
R&eacute;gions</h3>
Une r&eacute;gion d'int&eacute;r&ecirc;t dans Anatomist poss&egrave;de
plusieurs caract&eacute;ristiques int&eacute;ressantes, mais qui peuvent
vous troubler au premier abord.
<li>
Tout d'abord, fini les empilements de r&eacute;gions 2D pour simuler la
3D, vous pouvez d&eacute;sormais dessiner directement des r&eacute;gions
tridimensionnelles.</li>

<li>
Ensuite, les r&eacute;gions 3D d'Anatomist sont des r&eacute;gions voxels,
et non des r&eacute;gions g&eacute;om&eacute;triques (qui seront impl&eacute;ment&eacute;es
plus tard). Ceci signifie qu'il n'est plus n&eacute;cessaire d'effectuer
des unions de r&eacute;gions g&eacute;om&eacute;triques pour obtenir votre
r&eacute;gion finale. Vous pouvez dessiner petit bout par petit bout votre
r&eacute;gion 3D en conservant le&nbsp; m&ecirc;me nom.</li>

<li>
Enfin, vous n'avez pas besoin d'avoir un fichier par r&eacute;gion. Il
vous suffit d'avoir un fichier par session de ROI, la session contenant
un grand nombre de r&eacute;gions dessin&eacute;es sur la m&ecirc;me image.
Le fichier conserve tous les noms&nbsp; que vous aurez choisi et vous permettra
de retoucher vos r&eacute;gions m&ecirc;me apr&egrave;s avoir ferm&eacute;
Anatomist.</li>

<br>&nbsp;
<p>&nbsp;
<p>Voici comment proc&eacute;der pour g&eacute;rer les r&eacute;gions d'une
m&ecirc;me session.
<h5>
Cr&eacute;er une nouvelle r&eacute;gion</h5>

<li>
S&eacute;lectionnez la session &agrave; laquelle doit appartenir la r&eacute;gion.</li>

<li>
S&eacute;lectionnez dans le menu "<i>R&eacute;gion->New</i>",&nbsp; ou
tapez CTRL+N.</li>

<li>
Une fen&ecirc;tre appara&icirc;t vous demandant de choisir un nom de r&eacute;gion
parmi les noms du cadre de travail s&eacute;lectionn&eacute; dans le menu
"<i>FrameWork</i>". Si votre cadre est "<i>UserDefined</i>", vous pouvez
saisir le nom que vous voulez.</li>

<li>
La r&eacute;gion apparait dans le panneau Region, et est maintenant s&eacute;lectionn&eacute;e.</li>

<br>&nbsp;
<h5>
S&eacute;lectionner une r&eacute;gion</h5>

<li>
Cliquez tout simplement sur la r&eacute;gion.</li>

<li>
Dans la fen&ecirc;tre de dessin, la r&eacute;gion s&eacute;lectionn&eacute;e
appara&icirc;t toujours en rouge, tandis que les autres apparaissent dans
la couleur d&eacute;finie par le cadre de travail.</li>

<h5>
Renommer une r&eacute;gion</h5>

<li>
Double-cliquez sur la r&eacute;gion.</li>

<li>
Une fen&ecirc;tre appara&icirc;t vous demandant de saisir le nouveau nom
de r&eacute;gion parmi les noms du cadre de travail s&eacute;lectionn&eacute;
dans le menu "<i>FrameWork</i>". Si votre cadre est "<i>UserDefined</i>",
vous pouvez saisir le nom que vous&nbsp; voulez.</li>

<h5>
D&eacute;truire une r&eacute;gion</h5>

<li>
S&eacute;lectionnez la r&eacute;gion &agrave; d&eacute;truire dans le panneau
r&eacute;gion.</li>

<li>
S&eacute;lectionnez dans le menu "<i>Region->Delete</i>".</li>

<h5>
Exporter une r&eacute;gion sous forme de masque</h5>
La plupart des commandes Aims travaillent sur des images, et certaines
demandent un masque. Vous pouvez utiliser ce module de ROI pour tracer
ces masques. Afin de sauver sur le disque la r&eacute;gion (ET NON LA SESSION),
sous forme de volume 3D contenant 1 dans le masque dessin&eacute; et 0
en dehors :
<li>
S&eacute;lectionnez la r&eacute;gion &agrave; exporter.</li>

<li>
S&eacute;lectionnez dans le menu "<i>Region->Export As Mask</i>".</li>

<h5>
D&eacute;truire une r&eacute;gion</h5>

<li>
S&eacute;lectionnez la r&eacute;gion &agrave; d&eacute;truire dans le panneau
r&eacute;gion.</li>

<li>
S&eacute;lectionnez dans le menu "<i>Region->Delete</i>".</li>

<h5>
Fusionner des r&eacute;gions</h5>
Vous pouvez segmenter un organe en plusieurs r&eacute;gions, afin par exemple
d'effectuer des statistiques sp&eacute;cifiquement dans une sous-partie
de l'organe. A tout moment, vous pouvez fusionner ces sous-parties pour
retrouver votre organe complet. Notez que ce n'est absol&ucirc;ment pas
n&eacute;cessaire pour effectuer des statistiques sur la session enti&egrave;re.
<br>&nbsp;
<li>
S&eacute;lectionnez dans le menu "<i>Region->Fusion</i>".</li>

<li>
Une interface s'ouvre, dans laquelle vous devez choisir les r&eacute;gions
&agrave; fusionner et le nom de la r&eacute;gion issue de la fusion. Ce
nom est &agrave; choisir parmi les noms de r&eacute;gions &agrave; fusionner.
S'il ne vous convient pas, vous pourrez toujours renommer la r&eacute;gion
par la suite comme indiqu&eacute; dans "renommer une R&eacute;gion".</li>

<p><br><u>Note :</u> ATTENTION : il est impossile d'effectuer un Undo sur
une fusion. Dans le doute, sauvez votre session au pr&eacute;alable.
<h3>
Fen&ecirc;tre de dessin</h3>
Afin de dessiner vos r&eacute;gions d'int&eacute;r&ecirc;t vous avez besoin
d'une ou plusieurs fen&ecirc;tres Axiale, Sagittale, Coronale ou 3D, contenant
&agrave; la fois une image et la session en cours.
<li>
S&eacute;lectionnez la session en cours.</li>

<li>
S&eacute;lectionner l'image sur laquelle vous voulez dessiner.</li>

<li>
S&eacute;lectionnez dans le menu "<i>Window</i>" le type de fen&ecirc;tre
ad&eacute;quat, ou cliquez sur le bouton corresopndant du panneau Window.</li>

<br>&nbsp;
<h3>
Rafraichissement de l'interface</h3>
Lorsque vous chargez un graphe (&agrave; &eacute;viter) ou une image par
la fen&ecirc;tre de contr&ocirc;le d'Anatomist, vous devez pour les voir
appara&icirc;tre dans l'interface de ROI cliquer sur le bouton "<i>Refresh</i>".
<br>&nbsp;
<h2>
Dessin de r&eacute;gion</h2>
Une fois votre session ouverte et mise dans une fen&ecirc;tre, votre r&eacute;gion
cr&eacute;&eacute;e et s&eacute;lectionn&eacute;e, vous allez pouvoir dessiner
votre ROI.
<li>
Pour commencer, s&eacute;lectionnez dans la fen&ecirc;tre l'icone de dessin.</li>

<li>
Dans la Boite &agrave; Outils, s&eacute;lectionnez l'onglet "<i>Paint</i>".</li>

<h3>
Pinceau</h3>
Vous pouvez choisir trois types de pinceaux, de diff&eacute;rentes tailles.
<li>
<b>Point</b>. La taille n'a pas d'importance pour ce pinceau, qui est un
voxel unique.</li>

<li>
<b>Disque</b>. Ce cercle plein, au sens des voxels et non des mm, est de
taille variable et trac&eacute; dans le plan de coupe de la fen&ecirc;tre
de dessin.</li>

<li>
<b>Boule</b>. Cette sph&egrave;te pleine, au sens des voxels et non des
mm, est elle aussi de taille variable. C'est un v&eacute;ritable objet
3D qui s'&eacute;tend sur plusieurs coupes de part et d'autre de la coupe
visualis&eacute;e dans la fenetre de dessin</li>

<br>&nbsp;
<p>&nbsp;
<p>Le curseur en dessous des boutons permet de r&eacute;gler la taille
du disque et de la sph&egrave;re. Comme les disques et les sph&egrave;res
sont d&eacute;finies sur des voxels, attention aux images fortement anisotropes,
qui les font appara&icirc;tre comme des ellipses.
<h3>
Modes</h3>
Plusieurs modes vous sont propos&eacute;s pour vous faciliter la t&acirc;che
de dessin.
<br>&nbsp;
<li>
<b>Mode "ligne"</b>. Lorsque ce mode est activ&eacute;, les contours que
vous tracez sont continus. Sans lui, si vous dessinez rapidement, votre
pinceau laisse des traces &eacute;parses.</li>

<li>
<b>Mode "remplacement"</b>. Lorsque ce mode est activ&eacute;, la r&eacute;gion
dessin&eacute;e efface les autres r&eacute;gions se trouvant sous le pinceau.
Il peut &ecirc;tre int&eacute;ressant de laisser ce mode d&eacute;selectionn&eacute;,
lorsque vous tracez une r&eacute;gion jouxtant&nbsp;&nbsp; une autre r&eacute;gion
d&eacute;j&agrave; dessin&eacute;e, afin de ne pas avoir &agrave; retracer
finement les fronti&egrave;res entre ces deux r&eacute;gions.</li>

<li>
<b>Mode "curseur li&eacute;"</b>. Lorsque ce mode est activ&eacute;, si
vous visualisez la r&eacute;gion &agrave; dessiner sur plusieurs incidences,
vous pourrez suivre votre trac&eacute; sur tous ces plans de coupes.</li>

<h3>
Transparence</h3>
Vous pouvez r&eacute;gler la transparence de la r&eacute;gion s&eacute;lectionn&eacute;e.
<h3>
Actions</h3>
Si votre dernier trac&eacute; (entre le moment ou vous pressez le bouton
de la souris jusqu'au moment o&ugrave; vous le rel&acirc;chez) ne vous
pla&icirc;t pas, vous pouvez revenir en arri&egrave;re par le bouton "<i>Undo</i>".
Vous pouvez le faire autant de fois que vous le d&eacute;sirez, que cela
concerne un dessin ou un coup de gomme.
<p>A l'inverse, si vous venez d'effectuer des "<i>Undo</i>", vous pouvez
faire revenir enavant par le bouton "<i>Redo</i>".
<p>Vous disposez aussi d'un bouton pour tout effacer, mais vous ne pourrez
revenir en arri&egrave;re (pour l'instant, car c'est un bug en cours de
correction).
<br>&nbsp;
<h2>
Le dessin proprement dit</h2>
<img SRC="../../images/roi/roi.png" NOSAVE>
<p>Tout ce que vous pouvez effectuer avec la souris et le clavier directement
sur une fenetre de dessin s'affiche si vous laissez quelques instants votre
curseur sur l'icone de dessin. En voici un r&eacute;sum&eacute; :
<br>&nbsp;
<li>
<i>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Bouton Gauche</i>. Dessiner.</li>

<li>
<i>SHIFT+&nbsp;&nbsp; BoutonGauche.</i> Pot de peinture : remplit la region,
le mode de remplacement est pris en compte.</li>

<li>
<i>CTRL+&nbsp;&nbsp;&nbsp;&nbsp; Bouton Gauche</i>. Gommer.&nbsp; La taille
et le type de la gomme sont identiques &agrave; ceux du pinceau.</li>

<li>
<i>SHIFT+&nbsp;&nbsp; Bouton Milieu.</i> Zoom.</li>

<li>
<i>CTRL+&nbsp;&nbsp;&nbsp;&nbsp; Bouton Milieu.</i> Translation.</li>

<h2>
Visualisation</h2>
La vue 3d vous permet de visualiser au fur et &agrave; mesure du dessin
la forme tridimensionnelle de votre r&eacute;gion, voire de votre session
de regions d'interet.&nbsp; Si vous avez besoin d'une repr&eacute;sentation
plus jolie, avec des surfaces liss&eacute;es, exportez les r&eacute;gions
&agrave; visualiser sous forme de masque et utilisez la commande AimsMesh,
avec un param&egrave;tre --smoothIt aux alentours de 50. En ouvrant les
fichiers mesh dans anatomist, vous pourrez les visualiser dansune fen&ecirc;tre
3d.
<h2>
Autre facon de faire (d&eacute;conseill&eacute;)...</h2>

<h4>
Passer en mode dessin:</h4>
C'est pas simple:
<br>en gros:
<li>
Charger une image dans Anatomist</li>

<li>
L'afficher dans une fen&ecirc;tre (2D ou 3D)</li>

<li>
S&eacute;lectionner l'image dans la fen&ecirc;tre de contr&ocirc;le</li>

<li>
Dans le menu "objet-sp&eacute;cifique", choisir "ROI / cr&eacute;er un
graphe associ&eacute;": un object graphe est cr&eacute;e</li>

<li>
Mettre ce nouveau graphe dans la fen&ecirc;tre ou est affich&eacute; le
volume, ainsi que dans une fen&ecirc;tre Browser</li>

<li>
S&eacute;lectionner le graphe dans la fen&ecirc;tre de contr&ocirc;le</li>

<li>
Dans le menu "objet-sp&eacute;cifique", choisir "ROI / cr&eacute;er une
nouvelle r&eacute;gion": un noeud est cr&eacute;e dans le graphe, ainsi
qu'un objet Bucket dans ce noeud</li>

<li>
Dans le browser, ouvrir le graphe et le noeud jusqu'&agrave; voir le bucket
&agrave; l'int&eacute;rieur</li>

<li>
S&eacute;lectionner le bucket dans le browser: le contr&ocirc;le de dessin
devient activable dans la (les) fen&ecirc;tre(s) de visu</li>

<li>
Activer le contr&ocirc;le de dessin dans la fen&ecirc;tre de visu o&ugrave;
vous voulez dessiner</li>

<li>
Voil&agrave; &ccedil;a y est, vous pouvez gribouiller</li>

<br>&nbsp;
<center><table COLS=2 WIDTH="100%" NOSAVE >
<tr ALIGN=CENTER NOSAVE>
<td NOSAVE><img SRC="../../images/roi/roi.png" NOSAVE height=367 width=343></td>

<td NOSAVE><img SRC="../../images/roi/roi-browser.png" ALT="roi-browser view" NOSAVE height=306 width=364></td>
</tr>
</table></center>

<center><img SRC="../../images/roi/roi-control.png" ALT="roi-control view" NOSAVE height=273 width=512></center>

<h4>
Pour s'aider:</h4>

<li>
Changer de pinceau, en appuyant sur "b" (pour "boule"), on passe en mode
brosse sph&eacute;rique, en appuyant sur "d" (pour "disque" ) la brosse
est un disque qui ne dessine que dans la coupe visualis&eacute;e, "p" correspond
&agrave; "point" (je crois)</li>

<li>
Changer la taille du pinceau (en mode boule ou disque): touches "+" et
"-"</li>

<h4>
Sauver les r&eacute;gions:</h4>

<li>
Les r&eacute;gions sont sauv&eacute;es sous forme de graphe: s&eacute;lectionner
le graphe de ROI, et dans le menu "objet sp&eacute;cifique", faire "fichier
/ sauver"</li>

<li>
Pour sauver une seule r&eacute;gion, sous forme de volume (masque binaire),
s&eacute;lectionner le noeud correspondant &agrave; la r&eacute;gion voulue
(dans la fen&ecirc;tre de contr&ocirc;le ou dans un browser) et dans le
menu sp&eacute;cifique (fen&ecirc;tre de contr&ocirc;le ou bouton droit
de la souris selon le cas), choisir "fichier / exporter la r&eacute;gion
en tant que volume"</li>

<h4>
Pour une utilisation plus pratique:</h4>

<li>
Utiliser <b><i>BrainVISA</i></b>, avec un outil de pilotage d'Anatomist
qui vous met directement en mode dessin de ROI</li>

<li>
Utiliser un "script anatomist" (fichiers .ana) qui fait la m&ecirc;me chose</li>

</body>
</html>
