/* This software and supporting documentation are distributed by
 *     Institut Federatif de Recherche 49
 *     CEA/NeuroSpin, Batiment 145,
 *     91191 Gif-sur-Yvette cedex
 *     France
 *
 * This software is governed by the CeCILL-B license under
 * French law and abiding by the rules of distribution of free software.
 * You can  use, modify and/or redistribute the software under the
 * terms of the CeCILL-B license as circulated by CEA, CNRS
 * and INRIA at the following URL "http://www.cecill.info".
 *
 * As a counterpart to the access to the source code and  rights to copy,
 * modify and redistribute granted by the license, users are provided only
 * with a limited warranty  and the software's author,  the holder of the
 * economic rights,  and the successive licensors  have only  limited
 * liability.
 *
 * In this respect, the user's attention is drawn to the risks associated
 * with loading,  using,  modifying and/or developing or reproducing the
 * software by the user in light of its specific status of free software,
 * that may mean  that it is complicated to manipulate,  and  that  also
 * therefore means  that it is reserved for developers  and  experienced
 * professionals having in-depth computer knowledge. Users are therefore
 * encouraged to load and test the software's suitability as regards their
 * requirements in conditions enabling the security of their systems and/or
 * data to be ensured and,  more generally, to use and operate it in the

#include <QGroupBox>
#include <anatomist/application/fileDialog.h>

using namespace anatomist;
using namespace carto;
using namespace std;


RegionsFusionWindow::RegionsFusionWindow( QWidget * parent,
					  const QStringList& regions ) :
  QDialog( parent, Qt::WindowTitleHint ), myNewRegionName("")
{
  setModal( true );
  setWindowTitle( tr( "Regions Fusion" ) );

  QVBoxLayout *l = new QVBoxLayout( this ) ;

  selectRegions = new QListWidget( this ) ;
  l->addWidget( selectRegions );
  selectRegions->setMinimumHeight( 100 );
  selectRegions->setSizePolicy( QSizePolicy( QSizePolicy::Expanding,
                                             QSizePolicy::Expanding ) );
  selectRegions->addItems( regions ) ;
  selectRegions->setSelectionMode( QListWidget::ExtendedSelection ) ;

  selectRegionName = new QComboBox( this );
  l->addWidget( selectRegionName );
  selectRegionName->setCurrentIndex(0);

  QWidget *buttons = new QWidget( this );
  l->addWidget( buttons );
  QHBoxLayout *blay = new QHBoxLayout( buttons );

  QPushButton *okButton = new QPushButton( tr( "Ok" ), buttons );
  blay->addWidget( okButton );
  okButton->setDefault( true );
  okButton->setSizePolicy( QSizePolicy( QSizePolicy::Fixed,
                                        QSizePolicy::Fixed ) );
  QPushButton *cancelButton = new QPushButton( tr( "Cancel" ), buttons );
  blay->addWidget( cancelButton );
  cancelButton->setSizePolicy( QSizePolicy( QSizePolicy::Fixed,
                                            QSizePolicy::Fixed ) );

  QObject::connect( okButton , SIGNAL( clicked() ), this, SLOT( accept () ) );
  QObject::connect( cancelButton , SIGNAL( clicked() ),
                    this, SLOT( reject() ) );
  QObject::connect( selectRegions , SIGNAL( itemSelectionChanged() ),
                    this, SLOT( selectedRegionsChanged() ) );
}

// void
// NewUDRegion::redSliderChange( int value )
// {
//   _redLabel->setText( QString::number(value) ) ;
// }

// void
// NewUDRegion::greenSliderChange( int value )
// {
//   _greenLabel->setText( QString::number(value) ) ;
// }

// void
// NewUDRegion::blueSliderChange( int value )
// {
//   _blueLabel->setText( QString::number(value) ) ;
// }


set<string>
RegionsFusionWindow::regionsToBeFusioned()
{
  set<string> result ;
  QStringList::ConstIterator iter( mySelectedRegions.begin() ),
    last( mySelectedRegions.end() ) ;


  while( iter != last )
    {
      result.insert( iter->toStdString() );
      ++iter ;
    }
  return result ;
}

string
RegionsFusionWindow::newRegionName()
{
  return selectRegionName->currentText().toStdString();
}

void
RegionsFusionWindow::selectedRegionsChanged()
{
  mySelectedRegions.clear();
  for( unsigned int i = 0 ; i < selectRegions->count() ; ++i )
  {
    if( selectRegions->item( i )->isSelected() )
      mySelectedRegions.append( selectRegions->item(i)->text() );
  }
  selectRegionName->clear();
  selectRegionName->addItems( mySelectedRegions );
  selectRegionName->setCurrentIndex( 0 );
}


namespace anatomist
{
  struct RoiManagementActionView_Private
  {
    enum FrameWork
    {
      NEURO = 301,
      LATERALNEURO = 302,
      SULCI = 303,
      RAT_WB,
      USERDEFINED,
      FREE
    };


    RoiManagementAction * myRoiManagementAction ;

    QMenuBar 	* myMainMenu ;
    QMenu 	* mySessionMenu ;
    QMenu 	* myRegionMenu ;
    QMenu 	* myFrameWorkMenu ;
    QMenu 	* myUserDefinedFrameWorkMenu; // 305
    QMenu 	* myWindowMenu ;
    QAction *mySaveGraphAction;
    QAction *myNeuroAction; // 301
    QAction *myLateralNeuroAction; // 302
    QAction *mySulciAction; // 303
    QAction *myRatWbAction; // 304
    QAction *myNewRegionAction; // 314
    QAction *myModifyRegionNameAction; // 315
    QAction *myModifyRegionColorAction; // 316
    QAction *myDeleteRegionAction; // 317
    QAction *myFreeFrameworkAction; // 306

    QListWidget	* mySelectGraph ;

    QListWidget	* mySelectImage ;

    QListWidget	* mySelectRegion ;

    QPushButton * myAxial ;
    QPushButton * myCoronal ;
    QPushButton * mySagittal ;
    //     QPushButton * myOblique ;
    QPushButton * my3D ;
    // QPushButton	* myRefresh ;

    QSlider * myRegionTransparency ;
    QLabel * myRegionTransparencyLabel ;

    QSlider * myGraphTransparency ;
    QLabel * myGraphTransparencyLabel;
  };
}

using namespace anatomist ;
using namespace aims;

namespace
{

  set<RoiManagementActionView*> & roiManagementViews()
  {
    static set<RoiManagementActionView*>	rv;
    return rv;
  }

}

RoiManagementActionView::RoiManagementActionView( RoiManagementAction * action,
                                                  QWidget * parent )
  : QWidget(parent), Observer(), myUpdatingFlag(false),
    mySelectingImage(false),
    mySelectingGraph(false), mySelectingRegion(false),
