<!doctype public "-//w3c//dtd html 4.01 transitional//en" 
		"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  <title>Programmation Anatomist: modèle de contrôles</title>
  <style type="text/css">
    BODY {
	  text-align: justify;
	  margin: 0.5cm;
	}
  </style>
</head>
<body text="#000000" bgcolor="#FFFFFF" link="#0000EE" vlink="#551A8B" alink="#FF0000">

<center><table WIDTH="100%" NOSAVE >
<tr NOSAVE>
<td ALIGN=RIGHT VALIGN=CENTER NOSAVE>
<td ALIGN=RIGHT VALIGN=CENTER NOSAVE><img SRC="../../images/anaLogo.png" NOSAVE align=CENTER></td>

<td ALIGN=CENTER VALIGN=CENTER WIDTH="100%" NOSAVE>
<h1>
Anatomist: Modèle vue-contrôle</h1>
</td>

<td><a href="http://www-dsv.cea.fr/content/cea/d_dep/d_drm/d_shfj/d_unaf/">
<img SRC="../../images/logo_shfj_t.png" NOSAVE BORDER=0 align=CENTER></a>
<a href="mailto:&#109;&#97;&#110;&#103;&#105;&#110;&#64;&#115;&#104;&#102;&#106;&#46;&#99;&#101;&#97;&#46;&#102;&#114;">
<img SRC="../../images/feather.png" NOSAVE BORDER=0 align=CENTER></a></td>
</tr>
</table></center>

<hr WIDTH="100%">
<p><font color="#000000">Sujets</font>
<ol>
<li>
<font color="#000000"><a href="#Choix">Choix du format</a> disque/m&eacute;moire
pour les Vois Anatomist.</font></li>
</ol>

<ol>
<li>
<font color="#000000"><a href="#Controles">Controles </a>dans Anatomist.</font></li>
</ol>

<p><a NAME="Choix"></a><font color="#3366FF"><font size=+1>Choix du format
disque/m&eacute;moire pour les Vois Anatomist.</font></font>
<br><font color="#3366FF"><font size=+1></font></font>&nbsp;
<p><a NAME="Controles"></a><font color="#3366FF"><font size=+1>Controles
dans Anatomist.</font></font><font color="#3366FF"><font size=+1></font></font>
<p><font size=+1><font color="#3366FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</font><font color="#993399">

<i>* Design Patterns</i></font></font>
<br><font color="#000000">Anatomist applique le <i>Design Pattern&nbsp;</i>
Mod&egrave;le-Vue-Contr&ocirc;le. Selon ce <i>Pattern</i>, les objets anatomist
&agrave; manipuler forment le Mod&egrave;le. Ces mod&egrave;les sont visualisables
dans des Vues et peuvent &ecirc;tre modifi&eacute;s, ainsi que les param&egrave;tres
des Vues, par les Contr&ocirc;les. Ce qui suit traite de la difficult&eacute;
d'introduire les controles dans Anatomist en accord avec les <i>Design
Patterns</i> et les solutions retenues.</font><br>
<center><img src="../../images/programmation/modelviewcontrolsimple.png" align="center">
</center>

<p><font size=+1><font color="#3366FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</font><i><font color="#663366">*</font><font color="#993399"> Particularit&eacute;
d'Anatomist</font></i></font>
<br><font color="#000000">En g&eacute;n&eacute;ral, lorsqu'on parle de
ce <i>Design Pattern</i>, la vue ne permet de visualiser qu'un unique objet,
comme un document word . Dans Anatomist, les Mod&egrave;les sont vari&eacute;s,
peuvent appara&icirc;tre dans plusieurs Vues et une m&ecirc;me vue peut
rendre compte de plusieurs objets. Les modes d'interaction, appel&eacute;s
Contr&ocirc;les, d&eacute;pendent &agrave; la fois de la Vue et des Objets
pr&eacute;sents dans la Vue.</font>
<p><font size=+1><font color="#3366FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;

</font><i><font color="#993399">* Le Control Switch</font></i></font>
<br><font color="#000000">A cette premi&egrave;re complexit&eacute; se
rajoute la multiplicit&eacute; des interactions possibles avec un Mod&egrave;le
dans une Vue. En effet, dans le cas d'une r&eacute;gion d'int&eacute;r&ecirc;t
dans une fen&ecirc;tre 3d, un utilisateur peut vouloir la s&eacute;lectionner,
la faire tourner, modifier certains de ses param&egrave;tres, comme les
points de contr&ocirc;le dans le cas d'une repr&eacute;sentation de type
spline. Pour peu qu'un m&ecirc;me &eacute;v&eacute;nement utilisateur puisse
&ecirc;tre interpr&eacute;t&eacute; de facons diff&eacute;rentes pour un
objet dans une vue, nous devons donc &ecirc;tre en mesure de lui appliquer
plusieurs contr&ocirc;les diff&eacute;rents.</font>
<p><font color="#000000">Le Control Switch, qui fait partie du <i>Pattern
</i>Vue,
car il doit dialoguer avec sa fen&ecirc;tre, conna&icirc;t la liste des
contr&ocirc;les susceptibles d'&ecirc;tre activ&eacute;s dans une vue ainsi
que le Contr&ocirc;le actif. Il se charge de remettre sa liste de contr&ocirc;les
&agrave; jour lorsqu'un Mod&egrave;le est ajout&eacute; ou enlev&eacute;
de la Vue. Enfin, il envoie au Contr&ocirc;le actif les &eacute;v&eacute;nements
utilisateurs afin que ce dernier puisse les traiter.</font>
<p><font size=+1><font color="#3366FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;

</font><i><font color="#993399">* Cheminement d'un Ev&eacute;nement Utilisateur</font></i></font>
<br><font color="#000000">Lorsque le widget recoit un &eacute;v&eacute;nement
utilisateur, il le transmet au Control Switch, qui l'aiguille vers le Contr&ocirc;le
actif. Celui-ci d&eacute;code l'&eacute;v&eacute;nement et appelle l'unique
Action qui a demand&eacute; ce type d'&eacute;v&eacute;nement. Par exemple,
la touche "+" du clavier peut effectuer un zoom dans la Vue, la touche
"Page Up" changer le numero de coupe et un mouvement avec le bouton gauche
de la souris enfonc&eacute;e permet de se d&eacute;placer dans la coupe.</font>
<p><font color="#000000">La Vue n'a donc pas &agrave; savoir ce qu'il sera
fait de cet &eacute;v&eacute;nement, elle se contente de le transmettre
au Contr&ocirc;le.</font>
<p><font size=+1><font color="#3366FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;

</font><i><font color="#993399">* Le Control Manager</font></i></font>
<br><font color="#000000">Un objet doit garder la trace de l'ensemble des
modes d'interaction (Contr&ocirc;les) correspondant &agrave; une Vu et
un Mod&egrave;le donn&eacute;. Le Control Manager se charge de cette t&acirc;che.
Un module apportant de nouveaux Contr&ocirc;les vient les enregistrer aupr&egrave;s
du Control Manager,&nbsp; dans une map index&eacute;e par le type de Vue
et le type de Mod&egrave;le. Lorsqu'une vue est cr&eacute;&eacute;e, lorsqu'un
objet lui est ajout&eacute; ou enlev&eacute;, le Control Switch interroge
le Control manager pour conna&icirc;tre la liste des nouveaux Contr&ocirc;les
disponibles et modifie en cons&eacute;quence les menus ou icones de contr&ocirc;le
de la Vue.</font>
<p><font color="#000000">Lorsqu'il rajoute un Contr&ocirc;le &agrave; la
Vue, il en cr&eacute;e une nouvelle instance via le <i>Design Pattern </i>Factory.
Afin que les diverses Actions puissent poss&eacute;der des variables d'&eacute;tat
qui d&eacute;pendent de la Vue dans laquelle ils sont, chaque action est
aussi instanci&eacute;e et les liens entre Contr&ocirc;le et Action sont
cr&eacute;es via les m&eacute;thodes Subscribe du Contr&ocirc;le. Lorsqu'un
objet est retir&eacute; de la vue, les contr&ocirc;les associ&eacute;s
&agrave; cet objet et &agrave; aucun autre de la vue sont d&eacute;truits
avec toutes leurs Actions (ce qui peut poser le probl&egrave;me de la "m&eacute;moire"
des variables d'&eacute;tat d'une action).</font>
<br>
<center><img src="../../images/programmation/modelviewcontrol.png"></center>

<p>cf. <a href="aims/faq/index.html#Choix">FAQ</a>
aims
<hr>
</body>
</html>
