<!doctype public "-//w3c//dtd html 4.01 transitional//en" 
		"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  <title>Graph manipulation</title>
  <style type="text/css">
    BODY {
	  text-align: justify;
	  margin: 0.5cm;
	}
  </style>
</head>
<body text="#000000" bgcolor="#FFFFFF" link="#0000EF" vlink="#51188E" alink="#FF0000">
<table WIDTH="100%" NOSAVE >
<tr NOSAVE>
<td ALIGN=LEFT NOSAVE><img SRC="../../images/graph.png" NOSAVE align=CENTER></td>

<td ALIGN=CENTER VALIGN=CENTER NOSAVE>
<h1>
Anatomist: Manipulation de donn&eacute;es structur&eacute;es</h1>
</td>

<td ALIGN=RIGHT NOSAVE><img SRC="../../images/anaLogo.png" NOSAVE align=CENTER></td>
</tr>
</table>

<center>
<hr WIDTH="100%"></center>

<p><b><font size=+1><a href="#graphes">Graphes</a></font></b>
<br><b><font size=+1><a href="#browsers">Browsers</a></font></b>
<br><b><font size=+1><a href="#visu_graphes">Visualisation de graphes:</a></font></b>
<li>
<b><font size=+1><a href="#visu_graphes_bruts">Graphes "bruts"</a></font></b></li>

<li>
<b><font size=+1><a href="#visu_graphes_hierarchie">Graphes identifi&eacute;es
et hi&eacute;rarchie</a></font></b></li>

<br><b><font size=+1><a href="hints.html">Trucs et recettes</a></font></b>
<p>
<hr WIDTH="100%">
<h3>
Notes</h3>

<ol>
<li>
La manipulation de graphes et de donn&eacute;es structur&eacute;es dans
Anatomist est relativement peu automatis&eacute;e, les op&eacute;rations
peuvent sembler complexes, mais c'est ainsi: n'en demandez pas trop...</li>

<li>
Je n'explique pas tout ici, seulement les trucs les plus utiles pour les
utilisations courantes</li>
</ol>

<h1>
<a NAME="graphes"></a>Graphes</h1>
Fichiers .arg
<br>-> graphes de sillons
<br>-> graphes d'activations (de clusters)
<br>-> graphes de r&eacute;gions d'int&eacute;r&ecirc;t
<br>...
<p>Les graphes sont chargeables dans Anatomist en tant qu'objets.
<br>Ils n'apparaissent pas directement dans les fen&ecirc;tres (2D / 3D)
<p>Ils ont une structure et des sous-objets: noeuds et relations
<p><b><font color="#FF0000"><font size=+1>NE PAS METTRE DIRECTEMENT LES
NOEUDS DE GRAPHE DANS LES FENETRES</font></font></b>
<br>Sinon on perd tous les avantages du syst&egrave;me de manipulation
structurelle
<br>&nbsp;
<h1>
<a NAME="browsers"></a>Browsers</h1>
Un "browser" est un type de fen&ecirc;tre particulier dans Anatomist, qu'on
peut ouvrir comme toutes les autres par le menu "fen&ecirc;tres" ou l'ic&ocirc;ne
correspondante de la fen&ecirc;tre de contr&ocirc;le.
<br>C'est une fen&ecirc;tre non graphique: elle affiche les informations
sous forme de texte.
<br>Elle a &eacute;t&eacute; faite sp&eacute;cialement pour afficher la
structure des graphes et des hi&eacute;rarchies de noms.
<br>&nbsp;
<center><table WIDTH="100%" NOSAVE >
<tr ALIGN=CENTER NOSAVE>
<td NOSAVE><img SRC="../../images/graph/browser.gif" NOSAVE height=404 width=573>
<p>Browser</td>
</tr>
</table></center>

<h1>
<a NAME="visu_graphes"></a>Visualisation des graphes:</h1>

<h2>
<a NAME="visu_graphes_bruts"></a>Visualisation de graphes "bruts"</h2>
J'appelle ici "graphe brut" un graphe dont les noeuds n'ont pas de nom
distinctif qui permet de les reconnaitre et de les associer &agrave; une
couleur particuli&egrave;re.
<br>On visualise toujours un graphe avec l'anatomie qui lui correspond
(IRM en 2D ou triangulation du cerveau en 3D). En fait il est possible
de mettre un graphe seul dans une fen&ecirc;tre 3D (c'est fortement d&eacute;conseill&eacute;
en 2D) pour observer par ex. les formes des sillons sous tous les angles,
mais dans ce cas on utilise g&eacute;n&eacute;ralement 2 fen&ecirc;tres,
une avec l'anatomie et l'autre sans, puisque la s&eacute;lection en cliquant
sur l'image requiert l'anatomie.
<br>J'appelle "fen&ecirc;tre graphique" une fen&ecirc;tre de visualisation
graphique: 2D (axiale, sagittale, coronale) ou 3D, par opposition aux fen&ecirc;tres
browser.
<br>&nbsp;
<li>
Charger l'anatomie (triangulation .tri ou .mesh, ou IRM .ima, .vimg ou
.img)</li>

<li>
Charger le graphe dans Anatomist</li>

<li>
Ouvrir la ou les fen&ecirc;tres graphiques (2D / 3D)</li>

<li>
Mettre l'anatomie et le graphe dans les fen&ecirc;tres graphiques (on ne
voit que l'anatomie, le graphe est invisible)</li>

<li>
Passer les fen&ecirc;tres graphiques en mode "selection" (il faut le faire
fen&ecirc;tre par fen&ecirc;tre)</li>

<p>
<center>
<p><img SRC="../../images/graph/selection.gif" NOSAVE height=390 width=396></center>

<p>On visualise les noeuds d'un graphe en les s&eacute;lectionnant, plusieurs
m&eacute;thodes de s&eacute;lection sont possibles:
<br>&nbsp;
<h3>
Mode "de base"</h3>
Pour voir les &eacute;l&eacute;ments du graphe situ&eacute;s &agrave; une
position donn&eacute;e, cliquer sur l'anatomie &agrave; l'endroit voulu
(en mode de s&eacute;lection), les &eacute;l&eacute;ments du graphe situ&eacute;s
&agrave; cet endroit apparaissent.
<br>L'&eacute;l&eacute;ment sur lequel on clique est "s&eacute;lectionn&eacute;":
il apparait avec une couleur diff&eacute;rente, pr&eacute;d&eacute;finie.
<br>&nbsp;
<center><table COLS=2 WIDTH="100%" NOSAVE >
<tr>
<td><img SRC="../../images/graph/clicknoeud.gif" NOSAVE height=390 width=396></td>

<td><img SRC="../../images/graph/clicknoeud2.gif" NOSAVE height=390 width=396></td>
</tr>
</table></center>

<h4>
S&eacute;lection:</h4>
On peut s&eacute;lectionner des noeuds sans d&eacute;s&eacute;lectionner
ceux qui le sont d&eacute;j&agrave; en cliquant sur un noeud non s&eacute;lectionn&eacute;
tout en maintenant la touche "Ctrl" ou "Shift" enfonc&eacute;e.
<br>On peut d&eacute;selectionner un noeud s&eacute;lectionn&eacute; en
cliquant dessus tout en maintenant la touche "Ctrl" enfonc&eacute;e.
<br>&nbsp;
<h4>
Op&eacute;rations sur les noeuds s&eacute;lectionn&eacute;es:</h4>
Quand un ou plusieurs noeuds sont s&eacute;lectionn&eacute;s, le bouton
droit de la souris ouvre un menu dans lequel plusieurs op&eacute;rations
sont propos&eacute;es:
<center>
<p><img SRC="../../images/graph/menudroit.gif" NOSAVE height=390 width=396></center>

<p><br>
<li>
<b>View / Select objects</b>: ouvre une fen&ecirc;tre "browser" contenant
les objets s&eacute;lectionn&eacute;es. Rarement utile, voir plus loin
pour la manipulation des browsers.</li>

<li>
<b>Unselect</b>: d&eacute;selctionne tous les noeuds</li>

<li>
<b>Select all</b>: s&eacute;lectionne tous les objets pr&eacute;sents dans
la fen&ecirc;tre (y compris l'anatmie!), &agrave; utiliser tr&egrave;s
rarement en principe.</li>

<li>
<b>Remove from windows of this group</b>: retire les objets s&eacute;lectionn&eacute;s
de toutes les fen&ecirc;tres de ce groupe de fen&ecirc;tres. C'est normalement
de cette fa&ccedil;on qu'on retire les noeuds qu'on ne veut plus voir pour
ne pas encombrer la visualisation.</li>

<li>
<b>Remove from this window</b>: enl&egrave;ve les objets seulement de la
fen&ecirc;tre dans laquelle cette action est demand&eacute;e.</li>

<li>
<b>Object manipulations</b>: reproduit, pour les objets s&eacute;lectionn&eacute;s
dans les vues, le menu correspondant de la fen&ecirc;tre de contr&ocirc;le
d'Anatomist (qui lui agit sur les objets s&eacute;lectionn&eacute;s dans
la fen&ecirc;tre de contr&ocirc;le uniquement). Il permet par ex. de modifier
la couleur des noeuds choisis etc.</li>

<li>
<b>Select neighbours</b>: affiche et s&eacute;lectionne les noeuds voisins
dans le graphe. Tr&egrave;s utile pour explorer une r&eacute;gion sans
"rater" un noeud.</li>

<li>
<b>Select nodes of attribute</b>: permet d'effectuer des recherches et
s&eacute;lections sur un crit&egrave;re d'attribut de noeud (nom...)</li>

<br>&nbsp;
<h3>
Mode "browser"</h3>

<li>
Ouvrir un browser</li>

<li>
Mettre le graphe dans le browser</li>

<li>
Ouvrir dans le browser le graphe, ouvrir aussi "graph nodes": la liste
des noeuds apparait</li>

<li>
Cliquer sur un noeud: il apparait et se s&eacute;lectionne alors dans toutes
les fen&ecirc;tres contenant le graphe</li>

<br>&nbsp;
<h2>
<a NAME="visu_graphes_hierarchie"></a>Visualisation de graphes de donn&eacute;es
identifi&eacute;es en relation avec une hi&eacute;rarchie de noms</h2>
Ces graphes poss&egrave;dent sur chacun de leurs noeuds un attribut "name"
ou / et "label" qui leur donne un nom
<br>Les noms utilis&eacute;s correspondent normalement &agrave; une nomenclature
connue (activations, sillons, ...)
<br>La nomenclature correspondante peut &ecirc;tre charg&eacute;e dans
un objet "hi&eacute;rarchie" (fichiers .hie). Les objets hi&eacute;rarchie
ne sont pas repr&eacute;sentable dans les fen&ecirc;tres de visualisation
classiques 2D et 3D, mais seulement dans un browser.
<br>On utilise en principe l'attribut "name" pour des noms donn&eacute;es
manuellement, et "label" pour une identifaction automatique (sillons).
<br>&nbsp;
<li>
Charger la hi&eacute;rarchie dans Anatomist</li>

<li>
Ouvrir un browser</li>

<li>
Mettre la hi&eacute;rarchie dans le browser</li>

<li>
Ouvrir la fen&ecirc;tre de param&egrave;tres des graphes (accessible depuis
la petite fen&ecirc;tre de contr&ocirc;le AnaQt par le bouton "Graph parameters")</li>

<li>
Cocher l'onglet "Use hierarchy / color bindings"</li>

<li>
Si on souhaite une s&eacute;lection par attribut "label" plut&ocirc;t que
"name", changer la s&eacute;lection dans "Use attribute"</li>

<li>
On peut aussi autoriser l'affichage des bulles montrant les noms des noeuds
quand on pointe sur l'image en cochant l'onglet "Display ToolTips". Cela
n'est valable que pour les fen&ecirc;tres de visu d&eacute;j&agrave; ouvertes
au moment o&ugrave; on coche cet onglet. Pour des fen&ecirc;tres ouvertes
ensuite, il faut revenir aux param&egrave;tres de graphe et re-cocher cette
case.</li>

<center>
<p><br><img SRC="../../images/graph/graphParams.jpg" NOSAVE height=357 width=327></center>

<li>
Dans le browser contenant la hi&eacute;rarchie, ouvrir la hi&eacute;rarchie
de mani&egrave;re &agrave; voir les noms voulus</li>

<li>
Cliquer sur un nom: les noeuds correspondants s'afichent dans les fen&ecirc;tres
et sont s&eacute;lectionn&eacute;s.</li>

<li>
Pour voir les couleurs associ&eacute;es aux noms, d&eacute;selectionner
les noeuds (bouton droit, Unselect)</li>

<br>&nbsp;
<table COLS=2 WIDTH="100%" NOSAVE >
<tr NOSAVE>
<td ROWSPAN="2" NOSAVE><img SRC="../../images/graph/browser_hierarchie.gif" NOSAVE height=610 width=558></td>

<td><img SRC="../../images/graph/select_hierarchie_sel.gif" NOSAVE height=390 width=396></td>
</tr>

<tr>
<td><img SRC="../../images/graph/select_hierarchie_col.gif" NOSAVE height=390 width=396></td>
</tr>
</table>

<p>La hi&eacute;rarchie est organis&eacute;e, comme son nom l'indique,
de facon... hi&eacute;rarchique (oui). Cela veut dire qu'on peut s&eacute;lectionner
tous les noeuds d'un graphe situ&eacute;s "en dessous" d'un nom de la hi&eacute;rarchie
en cliquant sur ce nom. En clair, quand on clique sur un nom de lobe, tous
les sillons de ce lobe s'allument, et quand on clique sur "brain" dans
une hi&eacute;rarchie de sillons, tous les noeuds ayant &eacute;t&eacute;
identifi&eacute;s s'allument (mais pas ceux qui ont l'&eacute;tiquette
"unknown").
<br>Ce syst&egrave;me facilite grandement la visualisation et la s&eacute;lection
par r&eacute;gions.
<p><b><font color="#990000"><font size=+1>Pour fonctionner, la s&eacute;lection
par hi&eacute;rarchie doit remplir les conditions suivantes:</font></font></b>
<li>
La hi&eacute;rarchie doit correspondre au graphe: la valeur de l'attribut
"graph_syntax" de la hi&eacute;rarchie doit correspondre &agrave; la case
"Value" affich&eacute;e pour le graphe lorsqu'il est dans un browser (ex:
"CorticalFoldArg" pour un graphe de sillons).</li>

<li>
La correspondance entre hi&eacute;rarchie et graphe doit avoir &eacute;t&eacute;
valid&eacute;e dans les propri&eacute;t&eacute;s de graphes de la fen&ecirc;tre
de contr&ocirc;le. Cette validation est automatique si&nbsp; les graphes
sont charg&eacute;s apr&egrave;s la hi&eacute;rarchie, mais doit &ecirc;tre
activ&eacute;e manuellement si la hi&eacute;rachie est charg&eacute;e apr&egrave;s
le graphe..</li>

<hr WIDTH="100%">
<div align=right>Page suivante: <a href="hints.html">Trucs &amp;
recettes</a></div>

</body>
</html>
